# Python Pandas Tutorial 11- Reading/Writing Data
Welcome to the last module of the Panda's Tutorial! In this module, we will learn how to Read/Write Data to different sources - Excel,JSON,SQL,Etc.

In [1]:
#Reading a csv file.
import pandas as pd
df = pd.read_csv('C:\\Users\\QSUM1\\Desktop\\Lacey\\Data\\survey_results_public.csv')
#If you file isn't uploaded onto where you are trying to enter it, you'll need to copy the path.

In [7]:
import pandas as pd
people = { "first": ["Ben", "Han", "Luke", "Anakin", "Leia", "Chew", "Master"], 
"last": ["Kenobi", "Solo", "Skywalker", "Skywalker", "Organa", "Bacca", "Yoda"], 
"email": ["Benkenobi@email.com", "Hansolo@email.com", "Lukeskywalker@email.com", "Anakinskywalker@vader.com", "Leiaorgana@email.com", "Chewbacca@email.com", "Masteryoda@force.com"],
"salary": ["10000", "7000", "200000", "1000000","8000", "5000", "2000000"],
"planet": ["Stewjon", "Corellia", "Tatooine", "Tatooine", "Alderaan", "Kashyyyk", "Dagobah"]}

df = pd.DataFrame(people)
df

    first       last                      email   salary    planet
0     Ben     Kenobi        Benkenobi@email.com    10000   Stewjon
1     Han       Solo          Hansolo@email.com     7000  Corellia
2    Luke  Skywalker    Lukeskywalker@email.com   200000  Tatooine
3  Anakin  Skywalker  Anakinskywalker@vader.com  1000000  Tatooine
4    Leia     Organa       Leiaorgana@email.com     8000  Alderaan
5    Chew      Bacca        Chewbacca@email.com     5000  Kashyyyk
6  Master       Yoda       Masteryoda@force.com  2000000   Dagobah

In [9]:
#You can filter out certain information you're looking for.
filt = (df["last"] == "Skywalker")
Skywalker_df = df.loc[filt]
Skywalker_df.head()
 #Lets you look at the beginning of data. For this example, our data doesn't have alot of information that is similar, so only two come up.

    first       last                      email   salary    planet
2    Luke  Skywalker    Lukeskywalker@email.com   200000  Tatooine
3  Anakin  Skywalker  Anakinskywalker@vader.com  1000000  Tatooine

In [10]:
#If you want to export your new data, you can use the to_csv method.
#Use the same path you used to import the csv file with.
Skywalker_df.to_csv('C:\\Users\\QSUM1\\Desktop\\Lacey\\Data\\modified.csv')
#Now if you check your folder, the file will be saved there

Now let's look at how to read and write through some other formats.

In [11]:
#You might come accross a tabbed limited file. It's like a csv file but your data is seperated by tabs instead of commas.
#We are going to change the second csv to tsv and use a custom seperator for this. I used t for tabs.
Skywalker_df.to_csv('C:\\Users\\QSUM1\\Desktop\\Lacey\\Data\\modified.tsv', sep='\t')

If we want to write excel, we're going to have to install a few packages'

In [12]:
#pip install xlwt openpyxl xlrd

#xlwt will write to an older XLS Excel Format.
#openpyxl opens the newer xlsx Excel format.
#we can install xlrd to read excel files.

In [13]:
#We are going to use the to_excel method.
Skywalker_df.to_excel('C:\\Users\\QSUM1\\Desktop\\Lacey\\Data\\modified.xlsx')
#This saves the excel file.

In [15]:
#How to read in that same excel file that we just created.
test = pd.read_excel('C:\\Users\\QSUM1\\Desktop\\Lacey\\Data\\modified.xlsx')
test

   Unnamed: 0   first       last                      email   salary    planet
0           2    Luke  Skywalker    Lukeskywalker@email.com   200000  Tatooine
1           3  Anakin  Skywalker  Anakinskywalker@vader.com  1000000  Tatooine

In [16]:
#Let's write our modified data frame to a JSON file
Skywalker_df.to_json('C:\\Users\\QSUM1\\Desktop\\Lacey\\Data\\modified.json')

In [17]:
#We can add on to make this list-like and make new lines so it's easier to read.
Skywalker_df.to_json('C:\\Users\\QSUM1\\Desktop\\Lacey\\Data\\modified.json', orient='records', lines=True)

In [18]:
#to read this file, it's the same as the test = example we did earlier.
test = pd.read_json('C:\\Users\\QSUM1\\Desktop\\Lacey\\Data\\modified.json', orient='records', lines=True)
test

    first       last                      email   salary    planet
0    Luke  Skywalker    Lukeskywalker@email.com   200000  Tatooine
1  Anakin  Skywalker  Anakinskywalker@vader.com  1000000  Tatooine

The last format we're going to look at is sequal databases. 
You need to install a few more packages for this. Thus format is more complicated because you have to have the database set up so im going to assume it is already set up. I don't have the database so for the last few parts i have the comment what the code should look like.

In [19]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in c:\python310\lib\site-packages (2.9.6)
Note: you may need to restart the kernel to use updated packages.

In [20]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\python310\lib\site-packages (2.0.19)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\python310\lib\site-packages (from sqlalchemy) (4.7.1)
Requirement already satisfied: greenlet!=0.4.17 in c:\python310\lib\site-packages (from sqlalchemy) (2.0.2)
Note: you may need to restart the kernel to use updated packages.

In [21]:
from sqlalchemy import create_engine 

#allows us to connect to the data base

#now we should be able to create the engine that will allow us to connect to the database.

In [22]:
engine = create_engine('postgresql://dbuser:dbpass@localhostL:5432//sample_db')

#Now we're going to try to write our modified data frame to a table in the database. It will create this table for us by default.

    #Skywalker_df.to_sql('sample_table', engine)

sample_table is the table you want to write this data to.

if the table arleady exsists, you can add another argument.
    
    #Skywalker_df.to_sql('sample_table', engine, if_exists='replace')

#To read it, you can do this

    sql_df = pd.read_sql('sample_table',engine,)